IRP/src/InformationRegisters/Taxes/Taxes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>Taxes</name>
 <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
 <resources>
  <name>Use</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <resources>
  <name>Priority</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </resources>
 <resources>
  <name>IncludeToLandedCost</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Tax</name>
  <type>
   <types>CatalogRef.Taxes</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/CommonModules/TaxesServerReuse/Module.bsl
Function GetTaxesByCompany(Date, Company) Export
	Query = New Query();
	Query.Text =
	"SELECT
	|	TaxesSliceLast.Tax,
	|	TaxesSliceLast.Tax.Type AS Type,
	|	TaxesSliceLast.Tax.UseDocuments.(
	|		DocumentName) AS UseDocuments
	|FROM
	|	InformationRegister.Taxes.SliceLast(&Date, Company = &Company) AS TaxesSliceLast
	|WHERE
	|	TaxesSliceLast.Use
	|ORDER BY
	|	TaxesSliceLast.Priority";
	Query.SetParameter("Date"    , Date);
	Query.SetParameter("Company" , Company);
	
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	
	ArrayOfResults = New Array();
	While QuerySelection.Next() Do
		TaxInfo = New Structure();
		TaxInfo.Insert("Tax"          , QuerySelection.Tax);
		TaxInfo.Insert("Type"         , QuerySelection.Type);
		TaxInfo.Insert("UseDocuments" , QuerySelection.UseDocuments.Unload());
		ArrayOfResults.Add(TaxInfo);
	EndDo;
	Return ArrayOfResults;
EndFunction
